 # Połączenie z bazą danych przy pomocy sqlAlchemy

In [2]:
import sqlalchemy
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

Zapytanie do bazy i wypisanie wyników

In [3]:
#result_set = db.execute("SELECT * FROM city")  
#for r in result_set:  
#    print(r)

 # Połączenie z bazą danych przy pomocy psycopg2 i pandas

In [4]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

Zapytanie do bazy i wypisanie wyników

In [5]:
#df = pd.read_sql('select * from city',con=connection)
#df

## Połączenie za pomocą sqlAlchemy i pandas

In [6]:
df = pd.read_sql('select * from city', con=connection_sqlalchemy)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

Zadanie 1

In [7]:
df = pd.read_sql('select category_id from film_category', con=connection_sqlalchemy)
liczba_kategorii = df.max()

print("Liczba kategorii filmów w wypożyczalni wynosi: ",*liczba_kategorii)

Liczba kategorii filmów w wypożyczalni wynosi:  16

Zadanie 2

In [8]:
df = pd.read_sql('select name from category', con=connection_sqlalchemy)
df

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Zadanie 3

In [9]:
df = pd.read_sql('select * from film', con=connection_sqlalchemy)
najmlodszy = df.loc[df['release_year'].idxmax()]
najstarszy = df.loc[df['release_year'].idxmin()]

print("Najstarszy film jest z roku:", najstarszy[3],"i nazywa się:",najstarszy[1])
print("Najmłodszy film jest z roku:", najmlodszy[3],"i nazywa się:",najmlodszy[1])

Najstarszy film jest z roku: 2006 i nazywa się: Chamber Italian
Najmłodszy film jest z roku: 2006 i nazywa się: Chamber Italian

Zadanie 4

In [10]:
df = pd.read_sql('select rental_date from rental ', con=connection_sqlalchemy)
df

              rental_date
0     2005-05-24 22:54:33
1     2005-05-24 23:03:39
2     2005-05-24 23:04:41
3     2005-05-24 23:05:21
4     2005-05-24 23:08:07
...                   ...
16039 2005-08-23 22:26:47
16040 2005-08-23 22:42:48
16041 2005-08-23 22:43:07
16042 2005-08-23 22:50:12
16043 2005-05-24 22:53:30

[16044 rows x 1 columns]

In [11]:
df = pd.read_sql("select rental_date from rental WHERE rental_date BETWEEN '2005-07-01' and '2005-08-01'", con=connection_sqlalchemy)
liczba_wypozyczen = df.shape[0]
print("Pomiędzy 2005-07-01 a 2005-08-01 filmy w wypożyczalni wypożyczono",liczba_wypozyczen,"razy")

Pomiędzy 2005-07-01 a 2005-08-01 filmy w wypożyczalni wypożyczono 6709 razy

Zadanie 5

In [12]:
df = pd.read_sql("select rental_date from rental WHERE rental_date BETWEEN '2010-01-01' and '2011-02-01'", con=connection_sqlalchemy)
liczba_wypozyczen = df.shape[0]
print("Pomiędzy 2010-01-01 a 2011-02-01 filmy w wypożyczalni wypożyczono",liczba_wypozyczen,"razy")

Pomiędzy 2010-01-01 a 2011-02-01 filmy w wypożyczalni wypożyczono 0 razy

Zadanie 6

In [19]:
df = pd.read_sql("select amount from payment", con=connection_sqlalchemy)
najwieksza_platnosc = df.loc[df['amount'].idxmax()]
print("Największa płatność wynosiła: ",*najwieksza_platnosc)

Największa płatność wynosiła:  11.99

Zadanie 7

In [22]:
df = pd.read_sql("select country from country", con=connection_sqlalchemy)
df

                  country
0             Afghanistan
1                 Algeria
2          American Samoa
3                  Angola
4                Anguilla
..                    ...
104               Vietnam
105  Virgin Islands, U.S.
106                 Yemen
107            Yugoslavia
108                Zambia

[109 rows x 1 columns]